
## Plan Result




<pre><code>Plan: 0 to add, 6 to change, 0 to destroy.</code></pre>

* Update
  * azurerm_api_management_api_diagnostic.api_logs[0]
  * module.api_mgmt_product.azurerm_api_management_product.product
  * module.api_mgmt_product.azurerm_api_management_product_policy.apim_product_policy[0]
  * module.apim_apis.azurerm_api_management_api_operation.apim_api_operation[&#34;publication-health&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies[&#34;publication-health&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies[&#34;update-publication&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_api_management_api_diagnostic.api_logs[0] will be updated in-place
  ~ resource "azurerm_api_management_api_diagnostic" "api_logs" {
        id                        = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/apis/hmi-apim/diagnostics/applicationinsights"
      ~ sampling_percentage       = 25 -> 100
        # (10 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.api_mgmt_product.azurerm_api_management_product.product will be updated in-place
  ~ resource "azurerm_api_management_product" "product" {
        id                    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/products/hmi-product-stg"
      ~ subscriptions_limit   = 0 -> 20
        # (7 unchanged attributes hidden)
    }

  # module.api_mgmt_product.azurerm_api_management_product_policy.apim_product_policy[0] will be updated in-place
  ~ resource "azurerm_api_management_product_policy" "apim_product_policy" {
        id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/products/hmi-product-stg/policies/xml"
      ~ xml_content         = <<-EOT
            <policies>
          - 	<inbound>
          - 		<base />
          - 		<send-request ignore-error="false" timeout="20" response-variable-name="rateCallLimit" mode="new">
          - 			<set-url>https://hmi-kv-stg.vault.azure.net/secrets/rate-call-limit/?api-version=7.0</set-url>
          - 			<set-method>GET</set-method>
          - 			<authentication-managed-identity resource="https://vault.azure.net" />
          - 		</send-request>
          - 		<set-variable name="rateCallLimit" value="@{
          -                 var secret = ((IResponse)context.Variables["rateCallLimit"]).Body.As<JObject>();
          -                 return secret["value"].ToString();
          -             }" />
          - 		<rate-limit-by-key calls="@((int)context.Variables["rateCallLimit"])" renewal-period="60" counter-key="@(context.Request.Headers.GetValueOrDefault("X-Forwarded-For",""))" />
          - 	</inbound>
          - 	<backend>
          - 		<base />
          - 	</backend>
          - 	<outbound>
          - 		<base />
          - 	</outbound>
          - 	<on-error>
          - 		<base />
          - 	</on-error>
          +     <inbound>
          +         <base />
          +         <rate-limit-by-key calls="2000" renewal-period="60" counter-key="@(context.Request.Headers.GetValueOrDefault("X-Forwarded-For",""))" />
          +     </inbound>
          +     <backend>
          +         <base />
          +     </backend>
          +     <outbound>
          +         <base />
          +     </outbound>
          +     <on-error>
          +         <base />
          +     </on-error>
            </policies>
        EOT
        # (3 unchanged attributes hidden)
    }

  # module.apim_apis.data.azurerm_api_management_product.apim_product will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_api_management_product" "apim_product" {
      + api_management_name   = "sds-api-mgmt-stg"
      + approval_required     = (known after apply)
      + description           = (known after apply)
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + product_id            = "hmi-product-stg"
      + published             = (known after apply)
      + resource_group_name   = "ss-stg-network-rg"
      + subscription_required = (known after apply)
      + subscriptions_limit   = (known after apply)
      + terms                 = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.apim_apis.azurerm_api_management_api_operation.apim_api_operation["publication-health"] will be updated in-place
  ~ resource "azurerm_api_management_api_operation" "apim_api_operation" {
        id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/apis/hmi-apim/operations/publication-health"
        # (8 unchanged attributes hidden)

      ~ request {

          - query_parameter {
              - default_value = "123" -> null
              - name          = "artefact_id" -> null
              - required      = true -> null
              - type          = "string" -> null
              - values        = [] -> null
            }
        }

        # (1 unchanged block hidden)
    }

  # module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies["publication-health"] will be updated in-place
  ~ resource "azurerm_api_management_api_operation_policy" "apim_api_operation_policies" {
        id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/apis/hmi-apim/operations/publication-health/policies/xml"
      ~ xml_content         = (sensitive value)
        # (4 unchanged attributes hidden)
    }

  # module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies["update-publication"] will be updated in-place
  ~ resource "azurerm_api_management_api_operation_policy" "apim_api_operation_policies" {
        id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/apis/hmi-apim/operations/update-publication/policies/xml"
      ~ xml_content         = (sensitive value)
        # (4 unchanged attributes hidden)
    }

Plan: 0 to add, 6 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":4,"Program":"tfcmt","SHA1":"","Vars":{}} -->